[
    {
        "en": "There is no greater agony than bearing an untold story inside you.",
        "ru": "Нет большей муки, чем носить в себе нерассказанную историю.",
        "author": "Maya Angelou"
    },
    {
        "en": "You can make anything by writing.",
        "ru": "Вы можете создать что угодно, просто написав это.",
        "author": "C.S. Lewis"
    },
    {
        "en": "Start writing, no matter what. The water does not flow until the faucet is turned on.",
        "ru": "Начните писать, несмотря ни на что. Вода не течёт, пока не откроешь кран.",
        "author": "Louis L'Amour"
    },
    {
        "en": "The first draft is just you telling yourself the story.",
        "ru": "Первый черновик — это вы рассказываете историю самому себе.",
        "author": "Terry Pratchett"
    },
    {
        "en": "Write what should not be forgotten.",
        "ru": "Пишите то, что не должно быть забыто.",
        "author": "Isabel Allende"
    },
    {
        "en": "A writer is someone for whom writing is more difficult than it is for other people.",
        "ru": "Писатель — это тот, для кого писать труднее, чем для других людей.",
        "author": "Thomas Mann"
    },
    {
        "en": "We write to taste life twice, in the moment and in retrospect.",
        "ru": "Мы пишем, чтобы прожить жизнь дважды — в моменте и в воспоминаниях.",
        "author": "Anaïs Nin"
    },
    {
        "en": "If there's a book that you want to read, but it hasn't been written yet, then you must write it.",
        "ru": "Если есть книга, которую вы хотите прочитать, но она ещё не написана, значит, вы должны написать её.",
        "author": "Toni Morrison"
    },
    {
        "en": "The scariest moment is always just before you start.",
        "ru": "Самый страшный момент — всегда прямо перед началом.",
        "author": "Stephen King"
    },
    {
        "en": "Write hard and clear about what hurts.",
        "ru": "Пишите жёстко и ясно о том, что причиняет боль.",
        "author": "Ernest Hemingway"
    },
    {
        "en": "You must stay drunk on writing so reality cannot destroy you.",
        "ru": "Вы должны оставаться опьянёнными письмом, чтобы реальность не могла вас уничтожить.",
        "author": "Ray Bradbury"
    },
    {
        "en": "Writing is an exploration. You start from nothing and learn as you go.",
        "ru": "Письмо — это исследование. Вы начинаете с ничего и учитесь по ходу дела.",
        "author": "E.L. Doctorow"
    },
    {
        "en": "The role of a writer is not to say what we can all say, but what we are unable to say.",
        "ru": "Роль писателя — говорить не то, что можем сказать все мы, а то, что мы сказать не в силах.",
        "author": "Anaïs Nin"
    },
    {
        "en": "I write to discover what I know.",
        "ru": "Я пишу, чтобы открыть то, что я знаю.",
        "author": "Flannery O'Connor"
    },
    {
        "en": "Easy reading is damn hard writing.",
        "ru": "Лёгкое чтение — это чертовски трудное писание.",
        "author": "Nathaniel Hawthorne"
    },
    {
        "en": "No tears in the writer, no tears in the reader.",
        "ru": "Нет слёз у писателя — нет слёз у читателя.",
        "author": "Robert Frost"
    },
    {
        "en": "Fill your paper with the breathings of your heart.",
        "ru": "Заполните свою бумагу дыханием вашего сердца.",
        "author": "William Wordsworth"
    },
    {
        "en": "A word after a word after a word is power.",
        "ru": "Слово за словом за словом — это сила.",
        "author": "Margaret Atwood"
    },
    {
        "en": "You don't start out writing good stuff. You start out writing crap and thinking it's good stuff, and then gradually you get better at it.",
        "ru": "Вы не начинаете писать хорошие вещи. Вы начинаете писать ерунду и думаете, что это хорошо, а затем постепенно становитесь лучше.",
        "author": "Octavia Butler"
    },
    {
        "en": "If you want to be a writer, you must do two things above all others: read a lot and write a lot.",
        "ru": "Если вы хотите быть писателем, вы должны делать две вещи превыше всего: много читать и много писать.",
        "author": "Stephen King"
    },
    {
        "en": "Write drunk, edit sober.",
        "ru": "Пишите пьяным, редактируйте трезвым.",
        "author": "Peter De Vries"
    },
    {
        "en": "Writing is the only thing that when I do it, I don't feel I should be doing something else.",
        "ru": "Письмо — единственное, чем когда я занимаюсь, я не чувствую, что должен делать что-то ещё.",
        "author": "Gloria Steinem"
    },
    {
        "en": "Words are, of course, the most powerful drug used by mankind.",
        "ru": "Слова, конечно, самый мощный наркотик, используемый человечеством.",
        "author": "Rudyard Kipling"
    },
    {
        "en": "The art of writing is the art of discovering what you believe.",
        "ru": "Искусство писать — это искусство открывать то, во что вы верите.",
        "author": "Gustave Flaubert"
    },
    {
        "en": "I can shake off everything as I write; my sorrows disappear, my courage is reborn.",
        "ru": "Я могу стряхнуть всё, когда пишу; мои печали исчезают, моё мужество возрождается.",
        "author": "Anne Frank"
    },
    {
        "en": "Writing is a form of therapy; sometimes I wonder how all those who do not write, compose, or paint can manage to escape the madness.",
        "ru": "Письмо — это форма терапии; иногда я удивляюсь, как все те, кто не пишет, не сочиняет и не рисует, умудряются избежать безумия.",
        "author": "Graham Greene"
    },
    {
        "en": "The purpose of a writer is to keep civilization from destroying itself.",
        "ru": "Цель писателя — не дать цивилизации уничтожить себя.",
        "author": "Albert Camus"
    },
    {
        "en": "Writing is a struggle against silence.",
        "ru": "Письмо — это борьба с тишиной.",
        "author": "Carlos Fuentes"
    },
    {
        "en": "One day I will find the right words, and they will be simple.",
        "ru": "Однажды я найду правильные слова, и они будут простыми.",
        "author": "Jack Kerouac"
    },
    {
        "en": "The difference between the right word and the almost right word is the difference between lightning and a lightning bug.",
        "ru": "Разница между правильным словом и почти правильным словом — это разница между молнией и светлячком.",
        "author": "Mark Twain"
    },
    {
        "en": "I write entirely to find out what I'm thinking, what I'm looking at, what I see and what it means.",
        "ru": "Я пишу исключительно для того, чтобы узнать, что я думаю, на что смотрю, что вижу и что это означает.",
        "author": "Joan Didion"
    },
    {
        "en": "Writing is a socially acceptable form of schizophrenia.",
        "ru": "Письмо — это социально приемлемая форма шизофрении.",
        "author": "E.L. Doctorow"
    },
    {
        "en": "There is nothing to writing. All you do is sit down at a typewriter and bleed.",
        "ru": "В письме нет ничего особенного. Всё, что вы делаете — садитесь за печатную машинку и истекаете кровью.",
        "author": "Ernest Hemingway"
    },
    {
        "en": "Write what disturbs you, what you fear, what you have not been willing to speak about.",
        "ru": "Пишите о том, что вас беспокоит, чего вы боитесь, о чём не были готовы говорить.",
        "author": "Natalie Goldberg"
    },
    {
        "en": "A writer is a world trapped in a person.",
        "ru": "Писатель — это мир, заключённый в человеке.",
        "author": "Victor Hugo"
    },
    {
        "en": "Every secret of a writer's soul, every experience of his life, every quality of his mind, is written large in his works.",
        "ru": "Каждая тайна души писателя, каждый опыт его жизни, каждое качество его ума крупно написано в его работах.",
        "author": "Virginia Woolf"
    },
    {
        "en": "To produce a mighty book, you must choose a mighty theme.",
        "ru": "Чтобы создать великую книгу, вы должны выбрать великую тему.",
        "author": "Herman Melville"
    },
    {
        "en": "Writers are not just people who sit down and write. They hazard themselves.",
        "ru": "Писатели — это не просто люди, которые садятся и пишут. Они рискуют собой.",
        "author": "Nikki Giovanni"
    },
    {
        "en": "The writer is an explorer. Every step is an advance into new land.",
        "ru": "Писатель — это исследователь. Каждый шаг — это продвижение на новую землю.",
        "author": "Ralph Waldo Emerson"
    },
    {
        "en": "Description begins in the writer's imagination, but should finish in the reader's.",
        "ru": "Описание начинается в воображении писателя, но должно заканчиваться в воображении читателя.",
        "author": "Stephen King"
    },
    {
        "en": "A girl with her mother went to the platform. Mother pushed her under the train. Like shit, her brains scattered. Dad laughed so hard he pissed in his boots.",
        "ru": "Девочка с мамой пошла на перон. Мама толкнула её под вагон. Словно говно разлетелись мозги. Папа от смеха нассал в сапоги.",
        "author": "Viktor Kozhemyakin"
    },
    {
        "en": "Some love red-haired girls, some love men, but I love to shove it to a carp between the fins.",
        "ru": "Кто-то любит красных девок, кто-то любит мужиков, ну а я люблю впендюрить карасю меж плавников.",
        "author": "Gennady Fishkin"
    },
    {
        "en": "And the green crocodile pinched his balls in the door. The rabbits thought it was raspberries. They bit off half.",
        "ru": "А зелёный крокодил в дверях яйца прищемил. Зайцы думали - малина. Откусили половину.",
        "author": "Sergei Zaytsev"
    },
    {
        "en": "I'm writing you a letter and, as always, I miss you. And I knocked over some tea on my dick.",
        "ru": "Пишу тебе письмо и, как всегда, скучаю. И на ялду свою я опрокинул чаю.",
        "author": "Pavel Chайников"
    }
]

