[
    {
        "en": "There is no greater agony than bearing an untold story inside you.",
        "ru": "Нет большей муки, чем носить в себе нерассказанную историю.",
        "author": "Maya Angelou"
    },
    {
        "en": "I wish strong health, big successes in combat and politicheskgey podgatovkay sissy-massii, s prazdnigam daragiye druzya! ts",
        "ru": "Желаю крепкого здоровья, больших успехов в боевой и поличитескгэй подгатовкай сисси-массии, с празднигам дарагие друзя! ц",
        "author": "Leonid Brezhnev"
    },    
    {
        "en": "You can make anything by writing.",
        "ru": "Вы можете создать что угодно, просто написав это.",
        "author": "C.S. Lewis"
    },
    {
        "en": "Start writing, no matter what. The water does not flow until the faucet is turned on.",
        "ru": "Начните писать, несмотря ни на что. Вода не течёт, пока не откроешь кран.",
        "author": "Louis L'Amour"
    },
    {
        "en": "The first draft is just you telling yourself the story.",
        "ru": "Первый черновик — это вы рассказываете историю самому себе.",
        "author": "Terry Pratchett"
    },
    {
        "en": "Write what should not be forgotten.",
        "ru": "Пишите то, что не должно быть забыто.",
        "author": "Isabel Allende"
    },
    {
        "en": "A writer is someone for whom writing is more difficult than it is for other people.",
        "ru": "Писатель — это тот, для кого писать труднее, чем для других людей.",
        "author": "Thomas Mann"
    },
    {
        "en": "We write to taste life twice, in the moment and in retrospect.",
        "ru": "Мы пишем, чтобы прожить жизнь дважды — в моменте и в воспоминаниях.",
        "author": "Anaïs Nin"
    },
    {
        "en": "If there's a book that you want to read, but it hasn't been written yet, then you must write it.",
        "ru": "Если есть книга, которую вы хотите прочитать, но она ещё не написана, значит, вы должны написать её.",
        "author": "Toni Morrison"
    }
]

