{
  "latest": "2.2.2",
  "url": "https://github.com/gcbipdaniil/WriterPro/releases/download/v2.2.2/WriterPro-Setup-2.2.2.exe",
  "history": [
    {
      "version": "2.2.2",
      "releaseDate": "2025-11-12",
      "notes": {
        "ru": [
          "🔧 Исправление: Поработали над оптимизацией и скоростью приложения."
        ],
        "en": [
          "🔧 Fix: We worked on the optimization and speed of the app.",
        ]
      }
    },    
    {
      "version": "2.2.1",
      "releaseDate": "2025-11-12",
      "notes": {
        "ru": [
          "🚀 Улучшение: Приложение теперь запоминает размер и положение окна между сессиями.",
          "✨ Новая функция: Добавлена система автоматической проверки обновлений, чтобы вы всегда пользовались последней версией!",
          "🔧 Исправление: Небольшие правки производительности и оптимизация запуска."
        ],
        "en": [
          "🚀 Improvement: The application now remembers its window size and position between sessions.",
          "✨ New Feature: Added an automatic update checking system to ensure you always have the latest version!",
          "🔧 Fix: Minor performance tweaks and startup optimization."
        ]
      }
    },
    {
      "version": "2.2.0",
      "releaseDate": "2025-11-12",
      "notes": {
        "ru": [
          "✨ Новая функция: Реализован полный экспорт и импорт проекта в формате .wripro, включая все медиафайлы и заметки.",
          "🚀 Улучшение: Добавлены опции для экспорта в PDF (номера страниц, колонтитулы).",
          "🚀 Улучшение: Оптимизирован экспорт в EPUB для лучшей совместимости с читалками."
        ],
        "en": [
          "✨ New Feature: Implemented full project export and import in the .wripro format, including all media files and notes.",
          "🚀 Improvement: Added PDF export options (page numbers, headers, footers).",
          "🚀 Improvement: Optimized EPUB export for better e-reader compatibility."
        ]
      }
    },
    {
      "version": "2.1.1",
      "releaseDate": "2025-11-11",
      "notes": {
        "ru": [
          "🔧 Исправление: Устранена ошибка, из-за которой онбординг мог повторно появляться у некоторых пользователей.",
          "🔧 Исправление: Исправлена ошибка с подсчетом слов в реальном времени при вставке большого объема текста."
        ],
        "en": [
          "🔧 Fix: Resolved an issue where the onboarding could reappear for some users.",
          "🔧 Fix: Fixed a bug with the real-time word counter when pasting large amounts of text."
        ]
      }
    },
    {
      "version": "2.1.0",
      "releaseDate": "2025-11-11",
      "notes": {
        "ru": [
          "✨ Новая функция: Добавлен интерактивный онбординг, знакомящий новых пользователей со всеми возможностями WriterPro.",
          "🚀 Улучшение: Добавлены всплывающие подсказки для всех иконок в навигаторе."
        ],
        "en": [
          "✨ New Feature: Added an interactive onboarding tutorial to introduce new users to all of WriterPro's features.",
          "🚀 Improvement: Added tooltips for all icons in the navigator."
        ]
      }
    },
    {
      "version": "2.0.0",
      "releaseDate": "2025-11-10",
      "notes": {
        "ru": [
          "🎨 ГЛОБАЛЬНЫЙ РЕДИЗАЙН: Полностью переработан интерфейс приложения! Новые цвета, шрифты и иконки для лучшего пользовательского опыта.",
          "✨ Новая функция: Добавлен 'Режим чтения' для комфортной вычитки текста без отвлекающих элементов.",
          "✨ Новая функция: Добавлены новые темы оформления редактора: 'Nord' и 'Solarized'.",
          "🚀 Улучшение: Переработана панель навигации для более быстрого доступа к разделам."
        ],
        "en": [
          "🎨 GLOBAL REDESIGN: The application interface has been completely reworked! New colors, fonts, and icons for a better user experience.",
          "✨ New Feature: Added 'Reading Mode' for comfortable proofreading without distractions.",
          "✨ New Feature: Added new editor themes: 'Nord' and 'Solarized'.",
          "🚀 Improvement: The navigation panel has been redesigned for faster access to sections."
        ]
      }
    },
    {
      "version": "1.6.5",
      "releaseDate": "2025-11-09",
      "notes": {
        "ru": [
          "✨ Новая функция: Добавлена функция 'Найти и заменить' в текстовом редакторе.",
          "🚀 Улучшение: Теперь можно назначать горячие клавиши для основных действий (сохранение, фокус-режим).",
          "🚀 Оптимизация: Уменьшено потребление памяти при работе с текстами более 100 000 слов."
        ],
        "en": [
          "✨ New Feature: Added 'Find and Replace' functionality in the text editor.",
          "🚀 Improvement: You can now assign hotkeys for main actions (save, focus mode).",
          "🚀 Optimization: Reduced memory consumption when working with texts over 100,000 words."
        ]
      }
    },
    {
      "version": "1.6.0",
      "releaseDate": "2025-11-09",
      "notes": {
        "ru": [
          "✨ Новая функция: Появились 'Карты мыслей' (Mind Maps) для визуального планирования идей.",
          "🚀 Улучшение: Теперь узлы в Картах мыслей можно связывать с карточками персонажей и локаций."
        ],
        "en": [
          "✨ New Feature: Introduced 'Mind Maps' for visual planning of ideas.",
          "🚀 Improvement: Nodes in Mind Maps can now be linked to character and location cards."
        ]
      }
    },
    {
      "version": "1.5.0",
      "releaseDate": "2025-11-08",
      "notes": {
        "ru": [
          "✨ Новая функция: Добавлены 'Сюжетные линии' с цветовой маркировкой и 'Временная шкала' для визуализации хронологии.",
          "🚀 Улучшение: Добавлена возможность фильтрации сцен по сюжетной линии в навигаторе."
        ],
        "en": [
          "✨ New Feature: Added 'Storylines' with color-coding and a 'Timeline' for visualizing chronology.",
          "🚀 Improvement: Added the ability to filter scenes by storyline in the navigator."
        ]
      }
    },
    {
      "version": "1.4.2",
      "releaseDate": "2025-11-07",
      "notes": {
        "ru": [
          "🔧 Исправление: Устранена проблема с аутентификацией в Pinterest на некоторых системах.",
          "🔧 Исправление: Исправлено отображение длительности треков в музыкальном плеере."
        ],
        "en": [
          "🔧 Fix: Fixed an authentication issue with Pinterest on some systems.",
          "🔧 Fix: Corrected track duration display in the music player."
        ]
      }
    },
    {
      "version": "1.4.0",
      "releaseDate": "2025-11-07",
      "notes": {
        "ru": [
          "✨ Новая функция: Интегрирован музыкальный плеер с поиском треков.",
          "✨ Новая функция: Интеграция с Pinterest для поиска и сохранения изображений-референсов.",
          "✨ Новая функция: Теперь можно создавать папки для организации сохраненных изображений."
        ],
        "en": [
          "✨ New Feature: Integrated a music player with track search.",
          "✨ New Feature: Pinterest integration for finding and saving reference images.",
          "✨ New Feature: You can now create folders to organize saved images."
        ]
      }
    },
    {
      "version": "1.3.0",
      "releaseDate": "2025-11-06",
      "notes": {
        "ru": [
          "✨ Новая функция: Добавлена панель 'Аналитика' с отслеживанием целей написания.",
          "✨ Новая функция: Добавлен график 'Ежедневный прогресс' для визуализации вашей продуктивности.",
          "✨ Новая функция: Теперь можно добавлять заметки к каждой сцене."
        ],
        "en": [
          "✨ New Feature: Added an 'Analytics' panel with writing goal tracking.",
          "✨ New Feature: Added a 'Daily Progress' chart to visualize your productivity.",
          "✨ New Feature: You can now add notes to each scene."
        ]
      }
    },
    {
      "version": "1.2.0",
      "releaseDate": "2025-11-05",
      "notes": {
        "ru": [
          "✨ Новая функция: Добавлен 'Режим фокуса' для концентрации на тексте.",
          "✨ Новая функция: 'Режим пишущей машинки' (активная строка всегда по центру экрана).",
          "🚀 Улучшение: Расширены настройки форматирования текста."
        ],
        "en": [
          "✨ New Feature: Added 'Focus Mode' to concentrate on writing.",
          "✨ New Feature: 'Typewriter Mode' (active line always centered on screen).",
          "🚀 Improvement: Expanded text formatting options."
        ]
      }
    },
    {
      "version": "1.1.0",
      "releaseDate": "2025-11-04",
      "notes": {
        "ru": [
          "✨ Новая функция: Настройка шрифтов! Выбирайте любой установленный в системе шрифт для редактора.",
          "🚀 Улучшение: Добавлена возможность перетаскивать главы и сцены в навигаторе (Drag & Drop)."
        ],
        "en": [
          "✨ New Feature: Font customization! Choose any system-installed font for the editor.",
          "🚀 Improvement: Added the ability to drag and drop chapters and scenes in the navigator."
        ]
      }
    },
    {
      "version": "1.0.0",
      "releaseDate": "2025-11-04",
      "notes": {
        "ru": [
          "✨ Новая функция: Реализован экспорт проектов в PDF и DOCX. Приложение выходит из беты!",
          "✨ Новая функция: Добавлены детальные карточки для 'Локаций' и 'Объектов'."
        ],
        "en": [
          "✨ New Feature: Implemented project export to PDF and DOCX. The application is now out of beta!",
          "✨ New Feature: Added detailed cards for 'Locations' and 'Objects'."
        ]
      }
    },
    {
      "version": "0.5.0",
      "releaseDate": "2025-11-03",
      "notes": {
        "ru": [
          "✨ Новая функция: Добавлена 'Карта связей' для визуализации отношений между персонажами.",
          "🚀 Улучшение: В карточки персонажей добавлено больше полей (цели, страхи, привычки)."
        ],
        "en": [
          "✨ New Feature: Added a 'Relationship Map' to visualize connections between characters.",
          "🚀 Improvement: Added more fields to character cards (goals, fears, habits)."
        ]
      }
    },
    {
      "version": "0.2.0",
      "releaseDate": "2025-11-02",
      "notes": {
        "ru": [
          "✨ Новая функция: Появились карточки 'Персонажей' с биографией и возможностью добавлять фото."
        ],
        "en": [
          "✨ New Feature: Introduced 'Character' cards with biographies and the ability to add photos."
        ]
      }
    },
    {
      "version": "0.1.0",
      "releaseDate": "2025-11-01",
      "notes": {
        "ru": [
          "✨ Новая функция: Добавлена структура проекта 'Архитектура' для организации глав и сцен.",
          "✨ Новая функция: Автоматическое создание локальных резервных копий проекта каждые 10 минут."
        ],
        "en": [
          "✨ New Feature: Added 'Architecture' project structure for organizing chapters and scenes.",
          "✨ New Feature: Automatic local project backups every 10 minutes."
        ]
      }
    },
    {
      "version": "0.0.1",
      "releaseDate": "2025-11-01",
      "notes": {
        "ru": [
          "🎉 Первый публичный альфа-релиз WriterPro!",
          "✨ Основная функция: Базовый текстовый редактор с возможностью форматирования текста."
        ],
        "en": [
          "🎉 First public alpha release of WriterPro!",
          "✨ Core Feature: A basic text editor with text formatting capabilities."
        ]
      }
    }
  ]
}
