{
  "latest": "2.3.7",
  "url": "https://github.com/gcbipdaniil/WriterPro/releases/download/WriterPro-2.3.6/WriterPro-Setup-2.3.6.exe",
  "url_linux": "https://github.com/gcbipdaniil/WriterPro/releases/download/WriterPro-2.3.6/WriterPro-2.3.6.AppImage",
  "history": [
    {
      "version": "2.3.6",
      "releaseDate": "2025-12-17",
      "notes": {
        "ru": [
          "🚀 Добавлена официальная поддержка Linux (формат AppImage).",
          "🎨 Обновлен экран загрузки: теперь приложение приветствует вас названием вашей операционной системы.",
          "✨ Улучшена система обновлений: добавлена поддержка загрузки версий для разных платформ.",
          "🔧 Внутренние оптимизации для стабильной работы на Linux и macOS."
        ],
        "en": [
          "🚀 Added official Linux support (AppImage format).",
          "🎨 Updated loading screen: the app now greets you with your operating system name.",
          "✨ Improved update system: added support for downloading cross-platform versions.",
          "🔧 Internal optimizations for stable performance on Linux and macOS."
        ],
        "pl": [
          "🚀 Dodano oficjalne wsparcie dla systemu Linux (format AppImage).",
          "🎨 Zaktualizowano ekran ładowania: aplikacja wita teraz nazwą Twojego systemu operacyjnego.",
          "✨ Ulepszono system aktualizacji: dodano obsługę pobierania wersji na różne platformy.",
          "🔧 Wewnętrzne optymalizacje zapewniające stabilne działanie na systemach Linux i macOS."
        ]
      }
    },
    {
      "version": "2.3.4",
      "releaseDate": "2025-12-09",
      "notes": {
        "ru": [
          "🎨 Исправлен визуальный дефект верхней панели: теперь она корректно отображается поверх затемнения при открытии модальных окон.",
          "✨ Добавлена плавная анимация при переключении языков интерфейса.",
          "🚀 При клике на логотип теперь открывается информационное окно «О программе».",
          "🔧 Исправлена работа внешних ссылок: GitHub и Telegram теперь открываются в браузере по умолчанию, а не внутри приложения.",
          "✨ Добавлена кнопка быстрого перехода в Telegram разработчика."
        ],
        "en": [
          "🎨 Fixed top bar visual defect: header now correctly stays above the backdrop when modals are open.",
          "✨ Added smooth sliding animation for the language switcher.",
          "🚀 Clicking the app logo now opens the \"About\" modal window.",
          "🔧 Fixed external link behavior: GitHub and Telegram now open in your default browser instead of the app.",
          "✨ Added a direct link button to the developer's Telegram."
        ],
        "pl": [
          "🎨 Naprawiono defekt wizualny górnego paska: nagłówek wyświetla się teraz poprawnie nad tłem po otwarciu okien modalnych.",
          "✨ Dodano płynną animację podczas przełączania języków interfejsu.",
          "🚀 Kliknięcie w logo aplikacji otwiera teraz okno informacyjne „O programie”.",
          "🔧 Naprawiono działanie linków zewnętrznych: GitHub i Telegram otwierają się teraz w domyślnej przeglądarce.",
          "✨ Dodano przycisk szybkiego przejścia do Telegram dewelopera."
        ]
      }
    },
    {
      "version": "2.3.3",
      "releaseDate": "2025-12-08",
      "notes": {
        "ru": [
          "✨ Полностью обновлен дизайн Центра обновлений: добавлены анимации и новый интерфейс.",
          "🚀 Добавлена детальная статистика при скачивании: скорость, размер и время до завершения.",
          "🎨 Улучшена поддержка темной темы и адаптивность интерфейса обновлений.",
          "🔧 Оптимизирована загрузка истории версий (Lazy Loading) для повышения производительности."
        ],
        "en": [
          "✨ Completely redesigned Update Center: added animations and a new interface.",
          "🚀 Added detailed download statistics: speed, file size, and estimated time remaining.",
          "🎨 Improved dark mode support and update interface responsiveness.",
          "🔧 Optimized version history loading (Lazy Loading) for better performance."
        ],
        "pl": [
          "✨ Całkowicie przeprojektowane Centrum Aktualizacji: dodano animacje i nowy interfejs.",
          "🚀 Dodano szczegółowe statystyki pobierania: prędkość, rozmiar i szacowany czas.",
          "🎨 Ulepszono obsługę trybu ciemnego i responsywność interfejsu aktualizacji.",
          "🔧 Zoptymalizowano ładowanie historii wersji (Lazy Loading) dla lepszej wydajności."
        ]
      }
    },
    {
      "version": "2.3.2",
      "releaseDate": "2025-12-03",
      "notes": {
        "ru": [
          "🔧 Исправлена логика проверки лицензии: теперь кнопка \"Повторить\" на экране загрузки корректно перезапускает проверку ключа после восстановления интернета.",
          "✨ Добавлена кнопка принудительного обновления статуса лицензии в окне активации (полезно при сбоях сети).",
          "🎨 Обновлены тексты и переводы интерфейса лицензирования (RU/EN/PL)."
        ],
        "en": [
          "🔧 Fixed license verification logic: the \"Retry\" button on the loading screen now correctly re-initiates the key check after internet connection is restored.",
          "✨ Added a manual license status refresh button in the activation modal (useful during network glitches).",
          "🎨 Updated activation interface texts and translations (RU/EN/PL)."
        ],
        "pl": [
          "🔧 Naprawiono logikę weryfikacji licencji: przycisk \"Ponów\" na ekranie ładowania teraz poprawnie wznawia sprawdzanie klucza po przywróceniu połączenia internetowego.",
          "✨ Dodano przycisk ręcznego odświeżania statusu licencji w oknie aktywacji (przydatne przy problemach z siecią).",
          "🎨 Zaktualizowano teksty i tłumaczenia interfejsu aktywacji (RU/EN/PL)."
        ]
      }
    },
    {
      "version": "2.3.1",
      "releaseDate": "2025-11-30",
      "notes": {
        "ru": [
          "🚀 Добавлена полная поддержка открытия файлов .wripro двойным кликом из проводника Windows.",
          "🔧 Реализован режим одного окна (Single Instance): при попытке повторного запуска приложения фокус переводится на уже открытое окно.",
          "✨ Внедрена система всплывающих уведомлений для процессов импорта, создания и удаления проектов.",
          "🎨 Добавлена локализация для всех системных уведомлений (RU/EN/PL).",
          "🔧 Исправлена критическая ошибка в модуле импорта, из-за которой файлы не загружались автоматически."
        ],
        "en": [
          "🚀 Added full support for opening .wripro files via double-click from Windows Explorer.",
          "🔧 Implemented Single Instance Lock: prevents multiple application instances and focuses the existing window instead.",
          "✨ Introduced toast notifications for project import, creation, and deletion processes.",
          "🎨 Added localization for all system notifications (RU/EN/PL).",
          "🔧 Fixed a critical bug in the import module that prevented files from loading automatically."
        ],
        "pl": [
          "🚀 Dodano pełną obsługę otwierania plików .wripro poprzez dwukrotne kliknięcie w eksploratorze Windows.",
          "🔧 Wdrożono blokadę wielokrotnego uruchamiania (Single Instance): aplikacja przywołuje istniejące okno zamiast otwierać nowe.",
          "✨ Wprowadzono powiadomienia systemowe dla procesów importu, tworzenia i usuwania projektów.",
          "🎨 Dodano lokalizację dla wszystkich powiadomień systemowych (RU/EN/PL).",
          "🔧 Naprawiono krytyczny błąd w module importu, który uniemożliwiał automatyczne ładowanie plików."
        ]
      }
    },
    {
      "version": "2.3.0",
      "releaseDate": "2025-11-27",
      "notes": {
        "ru": [
          "🚀 Глобальное обновление экрана загрузки: новый премиальный дизайн в стиле «Big Tech» с фиксированными размерами.",
          "🎨 Восстановлен строгий темный стиль верхней панели для идеального сочетания с окном лицензии.",
          "✨ На экран загрузки добавлены кнопки управления окном (свернуть, закрыть).",
          "🔧 Исправлена работа переключателей языка и темы в заголовке (устранена блокировка нажатий областью перетаскивания)."
        ],
        "en": [
          "🚀 Major loading screen update: new premium 'Big Tech' style design with fixed dimensions.",
          "🎨 Restored the strict dark style of the title bar for perfect consistency with the license window.",
          "✨ Added window control buttons (minimize, close) to the loading screen.",
          "🔧 Fixed language and theme toggles in the header (resolved issue with drag region blocking clicks)."
        ],
        "pl": [
          "🚀 Globalna aktualizacja ekranu ładowania: nowy wygląd premium w stylu „Big Tech” ze stałymi wymiarami.",
          "🎨 Przywrócono surowy ciemny styl paska tytułu dla idealnej spójności z oknem licencji.",
          "✨ Dodano przyciski sterowania oknem (minimalizuj, zamknij) do ekranu ładowania.",
          "🔧 Naprawiono przełączniki języka i motywu w nagłówku (rozwiązano problem z blokowaniem kliknięć)."
        ]
      }
    },
    {
      "version": "2.2.9",
      "releaseDate": "2025-11-25",
      "notes": {
        "ru": [
          "🎨 Полностью переработан экран загрузки: новый современный дизайн с визуализацией этапов запуска.",
          "🔧 Улучшена стабильность проверки лицензии при нестабильном интернет-соединении.",
          "🔧 Исправлена логика кнопки «Повторить»: теперь приложение корректно перезагружается для повторной проверки сети."
        ],
        "en": [
          "🎨 Completely redesigned loading screen: new modern look with startup stage visualization.",
          "🔧 Improved license verification stability during unstable internet connections.",
          "🔧 Fixed 'Retry' button logic: the app now correctly reloads to re-verify network status."
        ],
        "pl": [
          "🎨 Całkowicie przebudowany ekran ładowania: nowy nowoczesny wygląd z wizualizacją etapów uruchamiania.",
          "🔧 Poprawiono stabilność weryfikacji licencji przy niestabilnym połączeniu internetowym.",
          "🔧 Naprawiono logikę przycisku „Ponów”: aplikacja teraz poprawnie odświeża się w celu ponownej weryfikacji sieci."
        ]
      }
    },
    {
      "version": "2.2.8",
      "releaseDate": "2025-11-21",
      "notes": {
        "ru": [
          "✨ Добавлена полная локализация на Польский язык."
        ],
        "en": [
          "✨ Added full Polish localization."
        ],
        "pl": [
          "✨ Dodano pełną polską lokalizację."
        ]
      }
    },
    {
      "version": "2.2.7",
      "releaseDate": "2025-11-18",
      "notes": {
        "ru": [
          "🚀 Полностью обновлен Глобальный поиск: добавлены фильтры (Текст, Персонажи, Локации, Объекты) и сортировка результатов.",
          "✨ Улучшен интерфейс поиска: добавлены удобные счетчики найденного и обновлен дизайн карточек.",
          "🔧 Исправлен режим «Без отвлечений»: устранена серая полоса сверху и добавлена плавающая кнопка для удобного выхода.",
          "🔧 Исправлена ошибка навигации, из-за которой проект мог открываться на месте предыдущего поиска."
        ],
        "en": [
          "🚀 Global Search completely overhauled: added filters (Text, Characters, Locations, Objects) and sorting options.",
          "✨ Improved search UI: added convenient result counters and updated card design.",
          "🔧 Distraction Free mode fixed: removed the extra top bar padding and added a floating exit button.",
          "🔧 Fixed a navigation bug where projects would occasionally open at the previous search result location."
        ],
        "pl": [
          "🚀 Wyszukiwanie globalne zostało całkowicie przebudowane: dodano filtry (Tekst, Postacie, Lokacje, Obiekty) i opcje sortowania.",
          "✨ Ulepszony interfejs wyszukiwania: dodano wygodne liczniki wyników i zaktualizowano wygląd kart.",
          "🔧 Naprawiono tryb „Bez rozpraszania”: usunięto zbędny pasek u góry i dodano pływający przycisk wyjścia.",
          "🔧 Naprawiono błąd nawigacji, przez który projekt mógł otwierać się w miejscu poprzedniego wyszukiwania."
        ]
      }
    },
    {
      "version": "2.2.6",
      "releaseDate": "2025-11-14",
      "notes": {
        "ru": [
          "🎨 Обновлен дизайн главной страницы (списка проектов) для более современного и удобного вида.",
          "🔧 Устранены различные мелкие ошибки и улучшена общая производительность приложения."
        ],
        "en": [
          "🎨 Updated the main page (project list) with a more modern and user-friendly design.",
          "🔧 Fixed various minor bugs and improved overall application performance."
        ],
        "pl": [
          "🎨 Zaktualizowano wygląd strony głównej (listy projektów), nadając jej nowocześniejszy i bardziej przyjazny charakter.",
          "🔧 Naprawiono różne drobne błędy i poprawiono ogólną wydajność aplikacji."
        ]
      }
    },
    {
      "version": "2.2.5",
      "releaseDate": "2025-11-14",
      "notes": {
        "ru": [
          "⚠️ Важно: Перед обновлением обязательно сделайте резервную копию ваших проектов! (Проект -> Экспортировать проект).",
          "✨ Новое: Добавлена система проверки и активации лицензии.",
          "🔧 Исправление: Улучшена работа функции автосклонения имен.",
          "🔧 Исправление: Устранены мелкие ошибки и повышена стабильность."
        ],
        "en": [
          "⚠️ Important: Please back up your projects before updating! (Project -> Export Project).",
          "✨ New: Added a license verification and activation system.",
          "🔧 Fix: Improved the name auto-declension feature.",
          "🔧 Fix: Addressed minor bugs and improved stability."
        ],
        "pl": [
          "⚠️ Ważne: Przed aktualizacją wykonaj kopię zapasową swoich projektów! (Projekt -> Eksportuj projekt).",
          "✨ Nowość: Dodano system weryfikacji i aktywacji licencji.",
          "🔧 Poprawka: Ulepszono działanie funkcji automatycznej odmiany imion.",
          "🔧 Poprawka: Usunięto drobne błędy i zwiększono stabilność."
        ]
      }
    },
    {
      "version": "2.2.4",
      "releaseDate": "2025-11-12",
      "notes": {
        "ru": [
          "🔧 Исправление: Поработали над оптимизацией и скоростью приложения."
        ],
        "en": [
          "🔧 Fix: We worked on the optimization and speed of the app."
        ],
        "pl": [
          "🔧 Poprawka: Pracowaliśmy nad optymalizacją i szybkością działania aplikacji."
        ]
      }
    },
    {
      "version": "2.2.3",
      "releaseDate": "2025-11-13",
      "notes": {
        "ru": [
          "✨ Новая вкладка «Имена» в профиле персонажа для управления склонениями и псевдонимами.",
          "✨ Добавлена функция автоматического склонения имён, которая помогает генерировать падежные формы.",
          "🚀 Улучшен анализатор упоминаний: теперь он находит персонажей по всем формам имени, главному псевдониму и всем склонениям."
        ],
        "en": [
          "✨ New 'Names' tab in the character profile to manage declensions and nicknames.",
          "✨ Added an automatic name declension feature to help generate case forms.",
          "🚀 Improved the mention analyzer: it now finds characters by all name forms, the main nickname, and all declensions."
        ],
        "pl": [
          "✨ Nowa zakładka „Imiona” w profilu postaci do zarządzania odmianami i przydomkami.",
          "✨ Dodano funkcję automatycznej odmiany imion, która pomaga generować formy przypadków.",
          "🚀 Ulepszono analizator wzmianek: teraz znajduje postacie po wszystkich formach imienia, głównym przydomku i wszystkich odmianach."
        ]
      }
    },
    {
      "version": "2.2.2",
      "releaseDate": "2025-11-12",
      "notes": {
        "ru": [
          "🔧 Исправление: Поработали над оптимизацией и скоростью приложения."
        ],
        "en": [
          "🔧 Fix: We worked on the optimization and speed of the app."
        ],
        "pl": [
          "🔧 Poprawka: Pracowaliśmy nad optymalizacją i szybkością działania aplikacji."
        ]
      }
    },
    {
      "version": "2.2.1",
      "releaseDate": "2025-11-12",
      "notes": {
        "ru": [
          "🚀 Улучшение: Приложение теперь запоминает размер и положение окна между сессиями.",
          "✨ Новая функция: Добавлена система автоматической проверки обновлений.",
          "🔧 Исправление: Небольшие правки производительности и оптимизация запуска."
        ],
        "en": [
          "🚀 Improvement: The application now remembers its window size and position between sessions.",
          "✨ New Feature: Added an automatic update checking system.",
          "🔧 Fix: Minor performance tweaks and startup optimization."
        ],
        "pl": [
          "🚀 Ulepszenie: Aplikacja zapamiętuje teraz rozmiar i położenie okna między sesjami.",
          "✨ Nowa funkcja: Dodano system automatycznego sprawdzania aktualizacji.",
          "🔧 Poprawka: Drobne poprawki wydajności i optymalizacja uruchamiania."
        ]
      }
    },
    {
      "version": "2.2.0",
      "releaseDate": "2025-11-12",
      "notes": {
        "ru": [
          "✨ Новая функция: Реализован полный экспорт и импорт проекта в формате .wripro, включая все медиафайлы и заметки.",
          "🚀 Улучшение: Добавлены опции для экспорта в PDF (номера страниц, колонтитулы).",
          "🚀 Улучшение: Оптимизирован экспорт в EPUB для лучшей совместимости с читалками."
        ],
        "en": [
          "✨ New Feature: Implemented full project export and import in the .wripro format, including all media files and notes.",
          "🚀 Improvement: Added PDF export options (page numbers, headers, footers).",
          "🚀 Improvement: Optimized EPUB export for better e-reader compatibility."
        ],
        "pl": [
          "✨ Nowa funkcja: Zaimplementowano pełny eksport i import projektu w formacie .wripro, w tym wszystkie pliki multimedialne i notatki.",
          "🚀 Ulepszenie: Dodano opcje eksportu do PDF (numery stron, nagłówki, stopki).",
          "🚀 Ulepszenie: Zoptymalizowano eksport do EPUB dla lepszej kompatybilności z czytnikami."
        ]
      }
    },
    {
      "version": "2.1.1",
      "releaseDate": "2025-11-11",
      "notes": {
        "ru": [
          "🔧 Исправление: Устранена ошибка, из-за которой онбординг мог повторно появляться у некоторых пользователей.",
          "🔧 Исправление: Исправлена ошибка с подсчетом слов в реальном времени при вставке большого объема текста."
        ],
        "en": [
          "🔧 Fix: Resolved an issue where the onboarding could reappear for some users.",
          "🔧 Fix: Fixed a bug with the real-time word counter when pasting large amounts of text."
        ],
        "pl": [
          "🔧 Poprawka: Rozwiązano problem, przez który samouczek mógł pojawiać się ponownie u niektórych użytkowników.",
          "🔧 Poprawka: Naprawiono błąd licznika słów w czasie rzeczywistym przy wklejaniu dużych ilości tekstu."
        ]
      }
    },
    {
      "version": "2.1.0",
      "releaseDate": "2025-11-11",
      "notes": {
        "ru": [
          "✨ Новая функция: Добавлен интерактивный онбординг, знакомящий новых пользователей со всеми возможностями WriterPro.",
          "🚀 Улучшение: Добавлены всплывающие подсказки для всех иконок в навигаторе."
        ],
        "en": [
          "✨ New Feature: Added an interactive onboarding tutorial to introduce new users to all of WriterPro's features.",
          "🚀 Improvement: Added tooltips for all icons in the navigator."
        ],
        "pl": [
          "✨ Nowa funkcja: Dodano interaktywny samouczek wprowadzający, który zapoznaje nowych użytkowników ze wszystkimi funkcjami WriterPro.",
          "🚀 Ulepszenie: Dodano podpowiedzi dla wszystkich ikon w nawigatorze."
        ]
      }
    },
    {
      "version": "2.0.0",
      "releaseDate": "2025-11-10",
      "notes": {
        "ru": [
          "🎨 ГЛОБАЛЬНЫЙ РЕДИЗАЙН: Полностью переработан интерфейс приложения! Новые цвета, шрифты и иконки.",
          "✨ Новая функция: Добавлен 'Режим чтения' для комфортной вычитки текста без отвлекающих элементов.",
          "🚀 Улучшение: Переработана панель навигации для более быстрого доступа к разделам."
        ],
        "en": [
          "🎨 GLOBAL REDESIGN: The application interface has been completely reworked! New colors, fonts, and icons.",
          "✨ New Feature: Added 'Reading Mode' for comfortable proofreading without distractions.",
          "🚀 Improvement: The navigation panel has been redesigned for faster access to sections."
        ],
        "pl": [
          "🎨 GLOBALNA ZMIANA DESIGNU: Interfejs aplikacji został całkowicie przebudowany! Nowe kolory, czcionki i ikony.",
          "✨ Nowa funkcja: Dodano „Tryb czytania” do wygodnej korekty tekstu bez elementów rozpraszających.",
          "🚀 Ulepszenie: Przebudowano panel nawigacyjny dla szybszego dostępu do sekcji."
        ]
      }
    },
    {
      "version": "1.6.5",
      "releaseDate": "2025-11-09",
      "notes": {
        "ru": [
          "✨ Новая функция: Добавлена функция 'Найти и заменить' в текстовом редакторе.",
          "🚀 Оптимизация: Уменьшено потребление памяти при работе с текстами более 100 000 слов."
        ],
        "en": [
          "✨ New Feature: Added 'Find and Replace' functionality in the text editor.",
          "🚀 Optimization: Reduced memory consumption when working with texts over 100,000 words."
        ],
        "pl": [
          "✨ Nowa funkcja: Dodano funkcję „Znajdź i zamień” w edytorze tekstu.",
          "🚀 Optymalizacja: Zmniejszono zużycie pamięci podczas pracy z tekstami powyżej 100 000 słów."
        ]
      }
    },
    {
      "version": "1.6.0",
      "releaseDate": "2025-11-09",
      "notes": {
        "ru": [
          "✨ Новая функция: Появились 'Карты мыслей' (Mind Maps) для визуального планирования идей."
        ],
        "en": [
          "✨ New Feature: Introduced 'Mind Maps' for visual planning of ideas."
        ],
        "pl": [
          "✨ Nowa funkcja: Wprowadzono „Mapy myśli” do wizualnego planowania pomysłów."
        ]
      }
    },
    {
      "version": "1.5.0",
      "releaseDate": "2025-11-08",
      "notes": {
        "ru": [
          "✨ Новая функция: Добавлены 'Сюжетные линии' с цветовой маркировкой и 'Временная шкала' для визуализации хронологии."
        ],
        "en": [
          "✨ New Feature: Added 'Storylines' with color-coding and a 'Timeline' for visualizing chronology."
        ],
        "pl": [
          "✨ Nowa funkcja: Dodano „Wątki fabularne” z kodowaniem kolorami oraz „Oś czasu” do wizualizacji chronologii."
        ]
      }
    },
    {
      "version": "1.4.2",
      "releaseDate": "2025-11-07",
      "notes": {
        "ru": [
          "🔧 Исправление: Устранена проблема с аутентификацией в Pinterest на некоторых системах.",
          "🔧 Исправление: Исправлено отображение длительности треков в музыкальном плеере."
        ],
        "en": [
          "🔧 Fix: Fixed an authentication issue with Pinterest on some systems.",
          "🔧 Fix: Corrected track duration display in the music player."
        ],
        "pl": [
          "🔧 Poprawka: Rozwiązano problem z uwierzytelnianiem w Pinterest na niektórych systemach.",
          "🔧 Poprawka: Poprawiono wyświetlanie czasu trwania utworów w odtwarzaczu muzyki."
        ]
      }
    },
    {
      "version": "1.4.0",
      "releaseDate": "2025-11-07",
      "notes": {
        "ru": [
          "✨ Новая функция: Интегрирован музыкальный плеер с поиском треков.",
          "✨ Новая функция: Интеграция с Pinterest для поиска и сохранения изображений-референсов.",
          "✨ Новая функция: Теперь можно создавать папки для организации сохраненных изображений."
        ],
        "en": [
          "✨ New Feature: Integrated a music player with track search.",
          "✨ New Feature: Pinterest integration for finding and saving reference images.",
          "✨ New Feature: You can now create folders to organize saved images."
        ],
        "pl": [
          "✨ Nowa funkcja: Zintegrowano odtwarzacz muzyki z wyszukiwaniem utworów.",
          "✨ Nowa funkcja: Integracja z Pinterest do wyszukiwania i zapisywania obrazów referencyjnych.",
          "✨ Nowa funkcja: Teraz można tworzyć foldery do organizowania zapisanych obrazów."
        ]
      }
    },
    {
      "version": "1.3.0",
      "releaseDate": "2025-11-06",
      "notes": {
        "ru": [
          "✨ Новая функция: Добавлена панель 'Аналитика' с отслеживанием целей написания.",
          "✨ Новая функция: Теперь можно добавлять заметки к каждой сцене."
        ],
        "en": [
          "✨ New Feature: Added an 'Analytics' panel with writing goal tracking.",
          "✨ New Feature: You can now add notes to each scene."
        ],
        "pl": [
          "✨ Nowa funkcja: Dodano panel „Analityka” ze śledzeniem celów pisarskich.",
          "✨ Nowa funkcja: Teraz można dodawać notatki do każdej sceny."
        ]
      }
    },
    {
      "version": "1.2.0",
      "releaseDate": "2025-11-05",
      "notes": {
        "ru": [
          "✨ Новая функция: Добавлен 'Режим фокуса' для концентрации на тексте.",
          "✨ Новая функция: 'Режим пишущей машинки' (активная строка всегда по центру экрана).",
          "🚀 Улучшение: Расширены настройки форматирования текста."
        ],
        "en": [
          "✨ New Feature: Added 'Focus Mode' to concentrate on writing.",
          "✨ New Feature: 'Typewriter Mode' (active line always centered on screen).",
          "🚀 Improvement: Expanded text formatting options."
        ],
        "pl": [
          "✨ Nowa funkcja: Dodano „Tryb skupienia” dla koncentracji na tekście.",
          "✨ Nowa funkcja: „Tryb maszyny do pisania” (aktywna linia zawsze na środku ekranu).",
          "🚀 Ulepszenie: Rozszerzono opcje formatowania tekstu."
        ]
      }
    },
    {
      "version": "1.1.0",
      "releaseDate": "2025-11-04",
      "notes": {
        "ru": [
          "✨ Новая функция: Настройка шрифтов! Выбирайте любой установленный в системе шрифт для редактора.",
          "🚀 Улучшение: Добавлена возможность перетаскивать главы и сцены в навигаторе (Drag & Drop)."
        ],
        "en": [
          "✨ New Feature: Font customization! Choose any system-installed font for the editor.",
          "🚀 Improvement: Added the ability to drag and drop chapters and scenes in the navigator."
        ],
        "pl": [
          "✨ Nowa funkcja: Dostosowywanie czcionek! Wybierz dowolną czcionkę systemową dla edytora.",
          "🚀 Ulepszenie: Dodano możliwość przeciągania i upuszczania rozdziałów oraz scen w nawigatorze."
        ]
      }
    },
    {
      "version": "1.0.0",
      "releaseDate": "2025-11-04",
      "notes": {
        "ru": [
          "✨ Новая функция: Реализован экспорт проектов в PDF и DOCX. Приложение выходит из беты!",
          "✨ Новая функция: Добавлены детальные карточки для 'Локаций' и 'Объектов'."
        ],
        "en": [
          "✨ New Feature: Implemented project export to PDF and DOCX. The application is now out of beta!",
          "✨ New Feature: Added detailed cards for 'Locations' and 'Objects'."
        ],
        "pl": [
          "✨ Nowa funkcja: Zaimplementowano eksport projektów do PDF i DOCX. Aplikacja wychodzi z fazy beta!",
          "✨ Nowa funkcja: Dodano szczegółowe karty dla „Lokacji” i „Obiektów”."
        ]
      }
    },
    {
      "version": "0.5.0",
      "releaseDate": "2025-11-03",
      "notes": {
        "ru": [
          "✨ Новая функция: Добавлена 'Карта связей' для визуализации отношений между персонажами.",
          "🚀 Улучшение: В карточки персонажей добавлено больше полей (цели, страхи, привычки)."
        ],
        "en": [
          "✨ New Feature: Added a 'Relationship Map' to visualize connections between characters.",
          "🚀 Improvement: Added more fields to character cards (goals, fears, habits)."
        ],
        "pl": [
          "✨ Nowa funkcja: Dodano „Mapę relacji” do wizualizacji powiązań między postaciami.",
          "🚀 Ulepszenie: Dodano więcej pól do kart postaci (cele, lęki, nawyki)."
        ]
      }
    },
    {
      "version": "0.2.0",
      "releaseDate": "2025-11-02",
      "notes": {
        "ru": [
          "✨ Новая функция: Появились карточки 'Персонажей' с биографией и возможностью добавлять фото."
        ],
        "en": [
          "✨ New Feature: Introduced 'Character' cards with biographies and the ability to add photos."
        ],
        "pl": [
          "✨ Nowa funkcja: Wprowadzono karty „Postaci” z biografią i możliwością dodawania zdjęć."
        ]
      }
    },
    {
      "version": "0.1.0",
      "releaseDate": "2025-11-01",
      "notes": {
        "ru": [
          "✨ Новая функция: Добавлена структура проекта 'Архитектура' для организации глав и сцен.",
          "✨ Новая функция: Автоматическое создание локальных резервных копий проекта каждые 10 минут."
        ],
        "en": [
          "✨ New Feature: Added 'Architecture' project structure for organizing chapters and scenes.",
          "✨ New Feature: Automatic local project backups every 10 minutes."
        ],
        "pl": [
          "✨ Nowa funkcja: Dodano strukturę projektu „Architektura” do organizowania rozdziałów i scen.",
          "✨ Nowa funkcja: Automatyczne tworzenie lokalnych kopii zapasowych projektu co 10 minut."
        ]
      }
    },
    {
      "version": "0.0.1",
      "releaseDate": "2025-11-01",
      "notes": {
        "ru": [
          "🚀 Первый публичный альфа-релиз WriterPro!",
          "✨ Основная функция: Базовый текстовый редактор с возможностью форматирования текста."
        ],
        "en": [
          "🚀 First public alpha release of WriterPro!",
          "✨ Core Feature: A basic text editor with text formatting capabilities."
        ],
        "pl": [
          "🚀 Pierwsze publiczne wydanie alfa WriterPro!",
          "✨ Główna funkcja: Podstawowy edytor tekstu z możliwością formatowania."
        ]
      }
    }
  ]
}
